In [4]:
import pandas as pd

apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,2,0,1])
print(apples,oranges)

0    3
1    2
2    0
3    1
dtype: int64 0    3
1    2
2    0
3    1
dtype: int64

# merging two pd.series using dictionary with pd.DataFrame

In [5]:
apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,2,0,1])

data = {"apples":apples,"oranges":oranges}   # dictionary 
fruit_df = pd.DataFrame(data)   # DataFrame
print(fruit_df)

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [15]:
state = ["ohio","ohio","ohio","nevada","nevada","nevada"]  # list of array
data = {"state":state,"years":[2000,2001,2002,2001,2001,2003],"pop":[1.5,1.7,3.6,2.4,2.9,3.2]}  # dictionary
frame =pd.DataFrame(data, index = ["1st","2nd","3rd","4th","5th","6th"])
print(frame)

      state  years  pop
1st    ohio   2000  1.5
2nd    ohio   2001  1.7
3rd    ohio   2002  3.6
4th  nevada   2001  2.4
5th  nevada   2001  2.9
6th  nevada   2003  3.2

In [17]:
frame = pd.DataFrame(data, columns = ["years","state","pop"])  # change column seq
frame.head()  # make chart

   years   state  pop
0   2000    ohio  1.5
1   2001    ohio  1.7
2   2002    ohio  3.6
3   2001  nevada  2.4
4   2001  nevada  2.9

In [29]:
# add unknown columns = dept, .head don't show error

frame = pd.DataFrame(data, columns = ["years","state","pop","dept"], index = ["one","two","three","four","five","six"])  # change column seq
frame.head()  # make chart

       years   state  pop dept
one     2000    ohio  1.5  NaN
two     2001    ohio  1.7  NaN
three   2002    ohio  3.6  NaN
four    2001  nevada  2.4  NaN
five    2001  nevada  2.9  NaN

In [31]:
print(frame.columns)
print(frame.index)

Index(['years', 'state', 'pop', 'dept'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# how to retrives info using dict like notation

In [35]:
print(data)

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'], 'years': [2000, 2001, 2002, 2001, 2001, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [33]:
data["state"]

['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada']

In [34]:
frame["years"]

one      2000
two      2001
three    2002
four     2001
five     2001
six      2003
Name: years, dtype: int64

In [36]:
frame["state"]

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

# there is another method to retrive data using attributes

In [37]:
frame.state

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [39]:
frame.years

one      2000
two      2001
three    2002
four     2001
five     2001
six      2003
Name: years, dtype: int64

In [40]:
frame.loc["one"]

years    2000
state    ohio
pop       1.5
dept      NaN
Name: one, dtype: object

In [44]:
print(frame.loc["six"])

years      2003
state    nevada
pop         3.2
dept        NaN
Name: six, dtype: object